itog/src/Documents/ВозвратОтКлиента/ВозвратОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратОтКлиента</name>
  <basedOn>Document.РеализацияТоваров</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРеализации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

itog/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ВозвратОтКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

itog/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

itog/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыНаСкладах</name>
        <description>Товары на складах</description>
        <code>41.01</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
      <childItems>
        <name>КассаОрганизации</name>
        <description>Касса организации</description>
        <code>50.01</code>
      </childItems>
      <childItems>
        <name>КассаОрганизацииВал</name>
        <description>Касса организации (в валюте)</description>
        <code>50.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>51</code>
    </items>
    <items>
      <name>ВалютныеСчета</name>
      <description>Валютные счета</description>
      <code>52</code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>60.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамВыданным</name>
        <description>Расчеты по авансам выданным</description>
        <code>60.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПокупателямиИЗаказчиками</name>
      <description>Расчеты с покупателями и заказчиками</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПокупателями</name>
        <description>Расчеты с покупателями</description>
        <code>62.01</code>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамПолученным</name>
        <description>Расчеты по авансам полученным</description>
        <code>62.02</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>СебестоимостьПродаж</name>
        <description>Себестоимость продаж</description>
        <code>90.02</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

itog/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.СчетаОрганизации</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Контрагенты</types>
    <types>DocumentRef.ПоступлениеТоваров</types>
    <types>DocumentRef.ЗаказКлиента</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СчетОрганизации</name>
      <description>Счет организации</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.СчетаОрганизации</types>
      </type>
    </items>
    <items>
      <name>Характеристики</name>
      <description>Характеристики</description>
      <code>000000003</code>
      <type>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

itog/src/Documents/ВозвратОтКлиента/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
    СуммаДокумента = Товары.Итог("Сумма");
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
	Автор = Пользователи.ТекущийПользователь();	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Покупатель = ДанныеЗаполнения.Покупатель;
		Склад = ДанныеЗаполнения.Склад;
		Основание = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.ЦенаРеализации = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ТоварыНаСкладах Приход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество; 
		СтруктураСебестоимость = ЗаполнитьПартиюСебестоимость(ТекСтрокаТовары.Номенклатура);
		
		Если СтруктураСебестоимость.Количество() > 0 Тогда
			Движение.Сумма = СтруктураСебестоимость.Себестоимость1шт * ТекСтрокаТовары.Количество;
			Движение.Партия = СтруктураСебестоимость.Партия;
		Иначе
			Отказ = Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Ошибка расчета себестоимости, документ должен быть создан на основании реализации товаров";
			СообщениеПользователю.Сообщить();
		КонецЕсли;
		
	КонецЦикла;

	// регистр Хозрасчетный 
	Движения.Хозрасчетный.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.ТоварыНаСкладах;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.КоличествоДт = ТекСтрокаТовары.Количество;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаТовары.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склады] = Склад;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Покупатель;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Договор;
	КонецЦикла;

КонецПроцедуры

Функция ЗаполнитьПартиюСебестоимость(Номенклатура) 
	
	СтруктураСебестоимость = Новый Структура();
	
	Если ЗначениеЗаполнено(Основание) Тогда
		
		СтруктураСебестоимость.Вставить("Партия");
		СтруктураСебестоимость.Вставить("Себестоимость1шт");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОбороты.СуммаРасход / ТоварыНаСкладахОбороты.КоличествоРасход КАК Себестоимость1шт,
		|	ТоварыНаСкладахОбороты.Партия КАК Партия
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
		|ГДЕ
		|	ТоварыНаСкладахОбороты.Регистратор = &Регистратор
		|	И ТоварыНаСкладахОбороты.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Регистратор", Основание);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		ТЗДанные = Запрос.Выполнить().Выгрузить();
		
		Если ТЗДанные.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойств(СтруктураСебестоимость,ТЗДанные[0]);
		КонецЕсли;
		
		
	КонецЕсли; 
	
	Возврат СтруктураСебестоимость;
	
КонецФункции
